Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКомпьютераЧПУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодразделения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриемаСрочных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Директор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКухонныхКоробов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЗаСрочность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСкладскиеОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалЗаказчикаНаценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалПодЗаказДваДняНаИзготовление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДляФизЛиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДляЮрЛиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПропила</Name>
					<Comment>Толщина пилы на заводе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыПодразделений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Подразделения/Forms/ФормаВыбораНескольких/Ext/Form/Module.bsl
&НаКлиенте
Процедура Все(Комана)

	Для каждого ъ Из Список Цикл
	
		ъ.Пометка = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ограничить подразделения только доступными пользователю
	
	//ДоступныВсеПодразделения = Ложь;
	//
	//РолиВсеПодразделения = Новый Массив;
	//РолиВсеПодразделения.Добавить("ГлавныйБухгалтер");
	//РолиВсеПодразделения.Добавить("ТолькоПросмотр");
	//РолиВсеПодразделения.Добавить("Администратор");
	//
	//Для каждого ъ Из РолиВсеПодразделения Цикл
	//	
	//	ДоступныВсеПодразделения = РольДоступна(ъ) ИЛИ ДоступныВсеПодразделения;
	//
	//КонецЦикла;
	//
	////Если ДоступныВсеПодразделения Тогда
	//	
	//	
	////Иначе
	////	Список = ЛексСервер.ПолучитьСписокДоступныхПодразделений(ОбщегоНазначения.ПолучитьПараметрСеанса("ТекущийПользователь"));
	////КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	(НЕ Подразделения.ПометкаУдаления)";
	
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// отметим подразделения которые были выделены
	Если Параметры.Свойство("ОригинальныйСписок") Тогда
		Для каждого ъ Из Параметры.ОригинальныйСписок Цикл
			
			ЗначениеПолногоСписка = Неопределено;
			ЗначениеПолногоСписка = Список.НайтиПоЗначению(ъ.Значение);
			
			Если ЗначениеПолногоСписка <> Неопределено Тогда
				ЗначениеПолногоСписка.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		
		СписокВыбранных = Новый СписокЗначений;
		
		Для каждого ъ Из Список Цикл
			Если ъ.Пометка Тогда
				СписокВыбранных.Добавить(ъ.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ОповеститьОВыборе(СписокВыбранных);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Розничные(Команда)
	
	РозничныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РозничныеНаСервере()

	Для каждого ъ Из Список Цикл
		ъ.Пометка = ъ.Значение.ВидПодразделения = Перечисления.ВидыПодразделений.Розница;
	КонецЦикла;

КонецПроцедуры // РозничныеНаСервере()

&НаКлиенте
Процедура Производственные(Команда)
	
	ПроизводственныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроизводственныеНаСервере()

	Для каждого ъ Из Список Цикл
		ъ.Пометка = ъ.Значение.ВидПодразделения = Перечисления.ВидыПодразделений.Производство;
	КонецЦикла;

КонецПроцедуры // ПроизводственныеНаСервере()

&НаКлиенте
Процедура Инвертировать(Команда)
	
	Для каждого ъ Из Список Цикл
		ъ.Пометка = НЕ ъ.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Для каждого ъ Из Список Цикл
	
		ъ.Пометка = Ложь;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БезБрендДилеров(Команда)
	
	БезБрендДилеровНаСервере();
	
КонецПроцедуры

&НаСервере
Функция БезБрендДилеровНаСервере()
	
	Для каждого ъ Из Список Цикл
		ъ.Пометка = НЕ ъ.Значение.БрендДилер;
	КонецЦикла;
	
КонецФункции
